export default [
  {
    id: 1,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기1',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 2,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기2',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 3,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기3',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 4,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 5,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 6,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
  {
    id: 7,
    nickname: '리종석',
    picture_url: 'https://picsum.photos/200/300',
    title: '오늘의 일기',
    content: `일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
       일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?
        일기 쓰면 여친 생기나? 일기 쓰면 여친 생기나?`,
    tags: ['태그', '태그', '태그'],
    created_at: String(new Date()),
    likes: 25000,
  },
];
